# **Assign Column Name with Highest Value to New Row**
# **Use of Pivot**
# **Use of Pivot_Table**
# **Use of idxmax**

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('Price2.csv')
print(df)

   Month  Year  Money
0    Jan  2002    615
1    Feb  2002    756
2    Mar  2002    455
3    Apr  2002    645
4    May  2002    669
5    Jun  2002    913
6    Jul  2002    157
7    Aug  2002    217
8    Sep  2002    985
9    Oct  2002    321
10   Nov  2002    847
11   Dec  2002    179
12   Jan  2003    329
13   Feb  2003    717
14   Mar  2003    278
15   Apr  2003    709
16   May  2003    995
17   Jun  2003    887
18   Jul  2003    391
19   Aug  2003    867
20   Sep  2003    459
21   Oct  2003    950
22   Nov  2003    536
23   Dec  2003    230
24   Jan  2004    896
25   Feb  2004    879
26   Mar  2004    934
27   Apr  2004    178
28   May  2004    726
29   Jun  2004    422
30   Jul  2004    429
31   Aug  2004    515
32   Sep  2004    915
33   Oct  2004    278
34   Nov  2004    151
35   Dec  2004    121
36   Jan  2005    108
37   Feb  2005    772
38   Mar  2005    906
39   Apr  2005    800
40   May  2005    324
41   Jun  2005    537
42   Jul  2005    699
43   Aug  2005    748
44   Sep  2005    437
45   Oct  2005    173
46   Nov  2005    195
47   Dec  2005    905

***Pivot for Formatting daraframe***

In [3]:
data = df.pivot('Month', 'Year', 'Money')
print(data)

Year   2002  2003  2004  2005
Month
Apr     645   709   178   800
Aug     217   867   515   748
Dec     179   230   121   905
Feb     756   717   879   772
Jan     615   329   896   108
Jul     157   391   429   699
Jun     913   887   422   537
Mar     455   278   934   906
May     669   995   726   324
Nov     847   536   151   195
Oct     321   950   278   173
Sep     985   459   915   437

***pivot_table***

Same as pivot but reset index/header

In [4]:
data=pd.pivot_table(df,index=['Month'],columns='Year',values='Money',aggfunc='sum').reset_index()
print(data)

Year Month  2002  2003  2004  2005
0      Apr   645   709   178   800
1      Aug   217   867   515   748
2      Dec   179   230   121   905
3      Feb   756   717   879   772
4      Jan   615   329   896   108
5      Jul   157   391   429   699
6      Jun   913   887   422   537
7      Mar   455   278   934   906
8      May   669   995   726   324
9      Nov   847   536   151   195
10     Oct   321   950   278   173
11     Sep   985   459   915   437

In [5]:
print(data.columns)

Index(['Month', 2002, 2003, 2004, 2005], dtype='object', name='Year')

***idxmax***

Find Top Valued Column

In [6]:
data['Max'] = data[[2002,2003,2004,2005]].idxmax(axis=1)
# Remember the headers are integer Or String
# For String header data['Max'] = data[['2002','2003','2004','2005']].idxmax(axis=1)
# https://stackoverflow.com/questions/63194591/idxmax-is-not-working-in-case-of-pivot-table-pandas/63194739#63194739
print(data)

Year Month  2002  2003  2004  2005   Max
0      Apr   645   709   178   800  2005
1      Aug   217   867   515   748  2003
2      Dec   179   230   121   905  2005
3      Feb   756   717   879   772  2004
4      Jan   615   329   896   108  2004
5      Jul   157   391   429   699  2005
6      Jun   913   887   422   537  2002
7      Mar   455   278   934   906  2004
8      May   669   995   726   324  2003
9      Nov   847   536   151   195  2002
10     Oct   321   950   278   173  2003
11     Sep   985   459   915   437  2002

In [7]:
print(data['Max'].value_counts())

2005    3
2004    3
2003    3
2002    3
Name: Max, dtype: int64